Ledrunning/animationClock/src/WEB/web_esp8266.c
#include "stm32f10x.h"
#include "web_esp8266.h" 
#include "usart.h "
#include "string.h"
#include "utils/delay.h"
#include "rtc/rtc.h"
#include "ds18x20.h"
#include "tft9341/tft9341.h"

uint16_t x_print = 300;
uint16_t y_print = 255;

uint8_t ret_ESP;
uint8_t send_OK;
uint8_t hard_reset;
uint8_t len_data;

unsigned char arr_data[256];
unsigned char array [256]; 
unsigned char mac [18]; 

uint8_t MY_SSID[16]= "wifi";
uint8_t MY_SSID_PWD[16]= "0123456789";

   /*------------Замена цвета---------------*/
   #define TRANS           0xFFFE	 
   #define BLACK           0x0000      /*   0,   0,   0 */
   #define NAVY            0x000F      /*   0,   0, 128 */
   #define DGREEN          0x03E0      /*   0, 128,   0 */
   #define DCYAN           0x03EF      /*   0, 128, 128 */
   #define MAROON          0x7800      /* 128,   0,   0 */
   #define PURPLE          0x780F      /* 128,   0, 128 */
   #define OLIVE           0x7BE0      /* 128, 128,   0 */
   #define LGRAY           0xC618      /* 192, 192, 192 */
   //#define DGRAY           0x7BEF      /* 128, 128, 128 */
   #define BLUE            0x001F      /*   0,   0, 255 */
   #define BLUE2			     0x051D
   #define GREEN           0x07E0      /*   0, 255,   0 */
   #define GREEN2		       0xB723
   #define GREEN3		       0x8000
   #define CYAN            0x07FF      /*   0, 255, 255 */
   #define RED             0xF800      /* 255,   0,   0 */
   #define MAGENTA         0xF81F      /* 255,   0, 255 */
   #define YELLOW          0xFFE0      /* 255, 255,   0 */
   #define WHITE           0xFFFF      /* 255, 255, 255 */
   #define ORANGE          0xFD20      /* 255, 165,   0 */
   #define GREENYELLOW     0xAFE5      /* 173, 255,  47 */
   #define BROWN 			     0XBC40 //
   #define BRRED 			     0XFC07 //
   #define LIGHTBLUE	     0X7D7C 
	 #define GRAY			       0X8430
   #define DGRAY			     0X2104
	 #define LIGHTRED	       0xFA08

void setSSID(uint8_t *ssid, uint8_t *pas){
		strcpy(MY_SSID,ssid);	
		strcpy(MY_SSID_PWD,pas);
	  //LogOut(OTSTUP_SLEVA_ERROR, OTSTUP_SVERHU_ERROR+5, MY_SSID , &Font_7x10, WHITE, BLACK);	
}

extern volatile uint8_t refresh_lcd;
typedef struct {
	uint8_t FontWidth;    /*!< Font width in pixels */
	uint8_t FontHeight;   /*!< Font height in pixels */
	const uint8_t *data; /*!< Pointer to data font data array */
} FontDef8_t;

FontDef8_t font_log;

 void LogOut_wifi(uint16_t x, uint16_t y, char *str, FontDef8_t *font, uint16_t foreground, uint16_t background){
//	 refresh_lcd=1; 	 
//	 cycl_multimetr(); 
//   ILI9341_Puts_pixel	 (x,y, str,  &font_log, GREEN, TRANS);
//	 //ILI9341_Puts(OTSTUP_SLEVA_ERROR, OTSTUP_SVERHU_ERROR+5, str , &Font_7x10, WHITE, TRANS);  
//	 delay_ms(250);		 
 }
 uint8_t ret_ESP_max;
 
 uint8_t connect_to_AP()
{	 
	if (ret_ESP>ret_ESP_max)ret_ESP_max=ret_ESP;
	
	 switch (ret_ESP)
		{ 			
			case 0  : 
			LogOut_wifi(x_print,   y_print, "ESP8266, response AT", &font_log, GREEN, BLACK);
			response_AT     ();
			break; // проверка ответа от АР
			
			case 1  : 
			LogOut_wifi(x_print,   y_print, "ESP8266, reset", &font_log, GREEN, BLACK);
			reset_AT        (); 
			break; // программный сброс
			
			case 2  : 
			LogOut_wifi(x_print,   y_print, "ESP8266, get mode", &font_log, GREEN, BLACK);
			mode_AT         (); 
			break; // проверка режима точка доступа или клиент?
			
			case 3  : 
			LogOut_wifi(x_print,   y_print, "ESP8266, select client", &font_log, GREEN, BLACK);
			select_clnt_AT  ();
			break; // переключение в режим клиента
			
		  case 4  : 
			LogOut_wifi(x_print,   y_print, "ESP8266, read connect", &font_log, GREEN, BLACK);
			rd_connect_AT   (); 
			break; // проверка подключения к базовой станции
			
			case 5  : 
			LogOut_wifi(x_print,   y_print, "ESP8266, connect wifi", &font_log, GREEN, BLACK);
			connect_AT      (); 
			break; // соединение с базовой станцией
			
			case 6  : 
			LogOut_wifi(x_print,   y_print, "ESP8266, read MAC", &font_log, GREEN, BLACK);
			read_MAC_AT     (); 
			break; // чтение IP и MAC
			
			case 7  : 
			LogOut_wifi(x_print,   y_print, "ESP8266, cipmux", &font_log, GREEN, BLACK);
			cipmux_AT       (); 
			break; // одиночные подключения
			
			case 8  : 
			LogOut_wifi(x_print,   y_print, "ESP8266, read sensors", &font_log, GREEN, BLACK);
			lead_data_sensor(); 
			break; // получение данных с датчиков
			
			
			case 9  : 
			LogOut_wifi(x_print,   y_print, "ESP8266, connect narodmon", &font_log, GREEN, BLACK);
			connect_serv_AT (); 
			break; // подключение к серверу
			
			case 10 : 
			//LogOut_wifi(x_print,   y_print, "ESP8266, send data", &font_log, GREEN, BLACK);
			send_data_AT    (); 
			break; // отправкка данных на сервер
			
			case 11 : 
			//LogOut_wifi(x_print,   y_print, "ESP8266, ret server", &font_log, GREEN, BLACK);
			read_ret_server (); 
			break; // получение ответа от сервера
			
			case 12 :
			LogOut_wifi(x_print,   y_print, "ESP8266, closed connect", &font_log, GREEN, BLACK);
			 closed_connect  (); 
			break; // закрытие соединения
			

			case 13 :  
			LogOut_wifi(x_print,   y_print, "ESP8266, connect serv time", &font_log, GREEN, BLACK);
			connect_serv_AT_time ();
			break; // подключение к серверу
			
			case 14 :  
			//LogOut_wifi(x_print,   y_print, "ESP8266, send time", &font_log, GREEN, BLACK);
			send_data_AT_time    ();
			break; // отправкка данных на сервер
			
			case 15 : 
			//LogOut_wifi(x_print,   y_print, "ESP8266, get time", &font_log, GREEN, BLACK);
			read_ret_server_time (); 
			break; // получение ответа от сервера
			
			case 16 : 
			LogOut_wifi(x_print,   y_print, "ESP8266, closed connect time", &font_log, GREEN, BLACK);
			closed_connect_time  (); 
			break; // закрытие соединения			
			
						
			case 17 : 
			//LogOut_wifi(x_print,   y_print, "END", &font_log, GREEN, BLACK);				
			return send_OK = 100;
			break;

			default:
			return send_OK = 0;				
			break;	
		}
	 return send_OK;
 }
 
 

//********************************************************************************************
//
//   ****          ТАЙМЕР СБРОСА ПРИ НЕОТВЕТЕ
//
//********************************************************************************************
void error_check (unsigned int delay_1)
 {
	 	 //HAL_IWDG_Refresh(&hiwdg);
     TIM4->PSC = 36000-1;
     TIM4->ARR = delay_1;
     TIM4->EGR |= TIM_EGR_UG;
     TIM4->CR1 |= TIM_CR1_CEN|TIM_CR1_OPM;
 }
 
//********************************************************************************************
//
// 0  ****          ПРОВЕРКА ОТВЕТА ОТ МОДУЛЯ
//
//********************************************************************************************
uint8_t response_AT (void) // проверка ответа
{
		//LCD_Fill(BLACK);
		error_check (1000); 
		arr_data_clear();
		array_clear();	
	
	  send_Uart_str(USART2,"ATE0\r\n"); // Проверка ответа от модуля, "перекличка"
	  do{
			read_str_uart(Buff_Uart);
		}
		while((!strstr(Buff_Uart,"OK")) && (!strstr(Buff_Uart,"ERROR")) && (TIM4->CR1 & TIM_CR1_CEN));
		TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	 
		
		if (strstr(Buff_Uart,"OK"))
		{
			//WriteString( 0, 0, "Ответ ESP8266,OK" , YELLOW);
			LogOut_wifi(x_print,   y_print, "AT response", &font_log, GREEN, BLACK);	
			//delay_ms (200);
			
		     error_check (1000); 
		     arr_data_clear();
		     array_clear();	
	
	       send_Uart_str(USART2,"AT+GMR\r\n"); // Проверка ответа от модуля, "перекличка"
	       do{
			     read_str_uart(Buff_Uart);
		     }
		     while((!strstr(Buff_Uart,"OK")) && (!strstr(Buff_Uart,"ERROR")) && (TIM4->CR1 & TIM_CR1_CEN));
		     TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	 			
			
				 
				 
			
			return ret_ESP = 2;          // переход дальше			
		}
		else if (strstr(Buff_Uart,"ERROR"))
		{
			//WriteString( 0, 0, "ERROR", RED);	
			LogOut_wifi(x_print,   y_print, "AT ERROR", &font_log, GREEN, BLACK);	
			//delay_ms (200);			
			return ret_ESP = 0;						// повтор
		}
		else if (strstr(Buff_Uart,"Busy is"))
		{
			//WriteString( 0, 0, "busy is" , RED);
			LogOut_wifi(x_print,   y_print, "AT busy", &font_log, GREEN, BLACK);
			//delay_ms (3000);
			return ret_ESP = 0;				// повтор
		}
		else if ((Buff_Uart)||(!Buff_Uart))
		{
			//WriteString( 0, 0, "time out, return" , WHITE);
			LogOut_wifi(x_print,   y_print, "Time out 0", &font_log, GREEN, BLACK);			
			//delay_ms (500);
			return ret_ESP = 1; 			// сброс
		}	
		return ret_ESP = 2; 		
}
//********************************************************************************************
//
//  1 ****          ПРОГРАММНЫЙ или ЖЕЛЕЗНЫЙ СБРОС
//
//********************************************************************************************
uint8_t reset_AT (void)  // программный ресет
{
	
	static uint8_t repite;
	
		//if (hard_reset++ == 5)
    // {
		 //LCD_Fill(BLACK);
	   //WriteString( 0, 5, "Перезапуск ESP8266" , RED);
		 //delay_ms (100);
		 //WriteString( 1, 5, "Стоп ESP8266" , YELLOW);
		 //GPIOA->BSRR =  GPIO_BSRR_BR11;  //GPIOA.11=0
		 //delay_ms (1000);
		 //WriteString( 2, 5, "Включение ESP8266" , WHITE);
		 //GPIOA->BSRR =  GPIO_BSRR_BS11;  //GPIOA.11=1
		 //delay_ms (1000);
		// }
		//LCD_Fill(BLACK);
		//WriteString( 0, 0, "Сброс ESP8266" , WHITE);
  	//LogOut_wifi(x_print,   y_print, "Reset ESP8266", &font_log, GREEN, BLACK);		
		//delay_ms (200);
		//WriteString( 1, 0, "ожидание..." , YELLOW);
	
		GPIO_ResetBits(GPIOB, GPIO_Pin_3);		
    delay_ms(100);			
		GPIO_SetBits(GPIOB, GPIO_Pin_3);
	
	
		error_check (3000); 
		arr_data_clear();
		array_clear();	
	
	  send_Uart_str(USART2,"AT+RST\r\n"); // Reset
		buff_clear();
	  do{
			read_str_uart(Buff_Uart);
		}
		while((!strstr(Buff_Uart,"ready")) && (!strstr(Buff_Uart,"ERROR"))&& (!strstr(Buff_Uart,"busy")) && (TIM4->CR1 & TIM_CR1_CEN));
		TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	  
			
		if (strstr(Buff_Uart,"ready"))
		{
			//WriteString( 2, 0, "чтение..." , YELLOW);
			//delay_ms (200);
			//WriteString( 3, 0, "Успешно!" , GREEN);
			LogOut_wifi(x_print,   y_print, "Reset OK", &font_log, GREEN, BLACK);		
			//delay_ms (1000);
			return ret_ESP = 0;						
		}
		else if (strstr(Buff_Uart,"ERROR"))
		{
			//WriteString( 2, 0, "ERROR", RED);
			LogOut_wifi(x_print,   y_print, "Reset ERROR", &font_log, GREEN, BLACK);		
			//delay_ms (200);			
			return ret_ESP = 1;						
		}
		else if (strstr(Buff_Uart,"busy"))
		{
			//WriteString( 2, 0, "busy is" , RED);
			LogOut_wifi(x_print,   y_print, "Busy is", &font_log, GREEN, BLACK);		
			//delay_ms (3000);
			return ret_ESP = 1;			
		}
		else if ((Buff_Uart)||(!Buff_Uart))
		{
			//WriteString( 2, 0, "time out, return" , WHITE);
			LogOut_wifi(x_print,   y_print, "ESP8266 not detected", &font_log, GREEN, BLACK);		
			//delay_ms (500);
			
		  if (repite<3){
				repite++;
		  	return ret_ESP = 1;				
			}
			else {
				repite=0;				
			  return ret_ESP = 99;
			}
			
			
			
