Ledrunning/animationClock/src/WEB/web_esp8266.c
		}	
		return ret_ESP = 0;	
}


//********************************************************************************************
//
// 2  ****          ПРОВЕРКА РЕЖИМА, КЛИЕНТ/ТОЧКА ДОСТУПА
//
//********************************************************************************************
unsigned char mode_AT (void)  //
{

		error_check (10000); 
		arr_data_clear();
		array_clear();	
	
	  send_Uart_str(USART2,"AT+CWMODE?\r\n"); // Проверка режима работы
	  do{
			read_str_uart(Buff_Uart);
		}
		while((!strstr(Buff_Uart,"MODE:1")) && (!strstr(Buff_Uart,"MODE:2")) && (!strstr(Buff_Uart,"MODE:3"))&& (!strstr(Buff_Uart,"busy")) && (TIM4->CR1 & TIM_CR1_CEN));
		TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	  
				
		if (strstr(Buff_Uart,"MODE:1"))
		{
			//WriteString( 1, 0, "Режим клиент, ОК" , GREEN);
			LogOut_wifi(x_print,   y_print, "AP, OK", &font_log, GREEN, BLACK);		
			//delay_ms (200);
			return ret_ESP = 4;						
		}
		else if (strstr(Buff_Uart,"MODE:2"))
		{
			//WriteString( 1, 0, "станция, NO", RED);	
			LogOut_wifi(x_print,   y_print, "ST -> Switching", &font_log, GREEN, BLACK);		
			//delay_ms (200);
			//WriteString( 2, 0, "переключение", RED);			
			//delay_ms (500);
			return ret_ESP = 3;						
		}
		else if (strstr(Buff_Uart,"MODE:3"))
		{
			//WriteString( 1, 0, "станция+клиент, NO", RED);	
			LogOut_wifi(x_print,   y_print, "ST+AP -> Switching", &font_log, GREEN, BLACK);		
			//delay_ms (200);
			//WriteString( 2, 0, "переключение", RED);	
							
			//delay_ms (500);
			return ret_ESP = 3;						
		}		
		else if (strstr(Buff_Uart,"busy"))
		{
			//WriteString( 1, 0, "busy is" , RED);
			LogOut_wifi(x_print,   y_print, "Busy is", &font_log, GREEN, BLACK);		
			//delay_ms (600);
			return ret_ESP = 2;			
		}
		else if ((Buff_Uart)||(!Buff_Uart))
		{
			//WriteString( 1, 0, "time out, return" , WHITE);
			LogOut_wifi(x_print,   y_print, "Time out, return 2", &font_log, GREEN, BLACK);		
			//delay_ms (500);
			return ret_ESP = 2;
		}	
		return ret_ESP = 4;		
}

//********************************************************************************************
//
//  3 ****          ПЕРЕКЛЮЧЕНИЕ В РЕЖИМ КЛИЕНТА //+ сервер
//
//********************************************************************************************
unsigned char select_clnt_AT (void)
{
	  
		error_check (10000); 
		arr_data_clear();
		array_clear();	
	
	  send_Uart_str(USART2,"AT+CWMODE=1\r\n"); // Проверка режима работы
	  do{
			read_str_uart(Buff_Uart);
		}
		while((!strstr(Buff_Uart,"OK")) && (!strstr(Buff_Uart,"ERROR"))&& (!strstr(Buff_Uart,"busy")) && (TIM4->CR1 & TIM_CR1_CEN));
		TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	 	 
		
		if (strstr(Buff_Uart,"OK"))
		{
			//WriteString( 3, 0, "клиент, ОК" , WHITE);	
      LogOut_wifi(x_print,   y_print, "Client, OK", &font_log, GREEN, BLACK);					
		}
		else if (strstr(Buff_Uart,"ERROR"))
		{
			//WriteString( 3, 0, "Ошибка", RED);
			LogOut_wifi(x_print,   y_print, "Client, error", &font_log, GREEN, BLACK);		
		}
		else if (strstr(Buff_Uart,"busy"))
		{
			//WriteString( 3, 0, "busy is" , RED);  			//delay_ms (2600);		
			LogOut_wifi(x_print,   y_print, "Busy is", &font_log, GREEN, BLACK);		
		}
		else if ((Buff_Uart)||(!Buff_Uart))
		{
			//WriteString( 3, 0, "time out, return" , WHITE);
			LogOut_wifi(x_print,   y_print, "Time out, return 3", &font_log, GREEN, BLACK);		
		}	
		//delay_ms (200);
		return ret_ESP = 1;	
}


//********************************************************************************************
//
// 4  ****         ПРОВЕРКА      ПОДКЛЮЧЕНИЯ К БАЗОВОЙ СТАНЦИИ
//
//********************************************************************************************
unsigned char rd_connect_AT(void)
{	
		error_check (10000); 
		arr_data_clear();
		array_clear();	
	
	  send_Uart_str(USART2,"AT+CWJAP?\r\n");
	  do{
			read_str_uart(Buff_Uart);
		}
		while((!strstr(Buff_Uart,"WJAP:")) && (!strstr(Buff_Uart,"No")) && (TIM4->CR1 & TIM_CR1_CEN));
		TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	 
			
		if (strstr(Buff_Uart,"CWJAP:"))
		{						
	  	//sprintf (array, "%s, ОК", Buff_Uart+8);
			//WriteString( 2, 0, "Подключено      ", GREEN);	
			LogOut_wifi(x_print,   y_print, "Wifi connected", &font_log, GREEN, BLACK);		
			//delay_ms (200);
			return ret_ESP = 6;						
		}
		else if (strstr(Buff_Uart,"No"))
		{
			//WriteString( 2, 0, "Нет подключения" , RED);
			LogOut_wifi(x_print,   y_print, "Not connect wifi", &font_log, GREEN, BLACK);		
			//delay_ms (200);
			return ret_ESP = 5;						
		}
		else if ((Buff_Uart)||(!Buff_Uart))
		{
			//WriteString( 2, 0, "time out, return" , WHITE);
			LogOut_wifi(x_print,   y_print, "Time out, return 4", &font_log, GREEN, BLACK);		
			//delay_ms (500);
			return ret_ESP = 1;
		}	
		return ret_ESP = 6;	
	
}

//********************************************************************************************
//
// 5  ****         ПОДКЛЮЧЕНИЕ К БАЗОВОЙ СТАНЦИИ
//
//********************************************************************************************
unsigned char connect_AT(void)
{
	static uint8_t repite;
	
	  //WriteString( 2, 0, "Подключение!      " , YELLOW);
	  //LogOut_wifi(x_print,   y_print, "Connect!      ", &font_log, GREEN, BLACK);		
//		delay_ms (200);
		error_check (10000); 	  	
	  arr_data_clear();
		array_clear();	
	
	  strcat (arr_data,"AT+CWJAP=");	
	  strcat (arr_data,"\"");   	
	  strcat (arr_data, MY_SSID);
	  strcat (arr_data,"\"");   	
	  strcat (arr_data,","); 
	  strcat (arr_data,"\"");  	
		strcat (arr_data, MY_SSID_PWD);
	  strcat (arr_data,"\"");  	
	  strcat (arr_data,"\r\n");  	

	  send_Uart_str(USART2, arr_data);//"AT+CWJAP_CUR=""Kurochka"",""sosolala""\r\n" AT+CWJAP="имя Вашей домашней сети wi-fi","пароль к ней"
	
	  //sprintf(array,"#H1#%2.2f#Home_Humidity\n", bmp280_hf ); 
		//strcat (arr_data, array);
	
	  do{
			read_str_uart(Buff_Uart);
		}
		while((!strstr(Buff_Uart,"OK")) && (!strstr(Buff_Uart,"FAIL"))&& (!strstr(Buff_Uart,"busy")) && (TIM4->CR1 & TIM_CR1_CEN));
		TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	  
		
		if (strstr(Buff_Uart,"OK"))
		{
			//WriteString( 2, 0, "Подключено!     " , GREEN);
			LogOut_wifi(x_print,   y_print, "Wifi connect", &font_log, GREEN, BLACK);		
			//delay_ms (200);
			return ret_ESP = 6;						
		}
		else if (strstr(Buff_Uart,"CONNECTED"))
		{
			//WriteString( 2, 0, "Подключено!     " , GREEN);
			LogOut_wifi(x_print,   y_print, "Wifi connect", &font_log, GREEN, BLACK);		
			//delay_ms (200);
			return ret_ESP = 6;						
		}		
		
		
		else if (strstr(Buff_Uart,"FAIL"))
		{
			//WriteString( 2, 0, "Подключено!     " , GREEN);
			LogOut_wifi(x_print,   y_print, "Wifi fail", &font_log, GREEN, BLACK);		
			//delay_ms (200);
			return ret_ESP = 5;						
		}		
		else if (strstr(Buff_Uart,"busy"))
		{
			//WriteString( 2, 0, "Подключено!     " , GREEN);
			LogOut_wifi(x_print,   y_print, "Wifi busy", &font_log, GREEN, BLACK);		
			//delay_ms (200);
			return ret_ESP = 5;						
		}				
		else if (strstr(Buff_Uart,"WJAP:3"))
		{
			//WriteString( 2, 0, "Неверный логин  ", RED);	
			LogOut_wifi(x_print,   y_print, "Error login", &font_log, GREEN, BLACK);		
			//delay_ms (200);
			return ret_ESP = 17;						
		}
		else if (strstr(Buff_Uart,"WJAP:1"))
		{
			//WriteString( 2, 0, "Неверный пароль ", RED);	
			LogOut_wifi(x_print,   y_print, "Error pasvord", &font_log, GREEN, BLACK);		
			//delay_ms (200);
			return ret_ESP = 17;						
		}
		else if ((Buff_Uart)||(!Buff_Uart))
		{
			//WriteString( 2, 0, "time out, return" , WHITE);
			LogOut_wifi(x_print,   y_print, "Time out, return 5", &font_log, GREEN, BLACK);		
			//delay_ms (500);
			if (repite<3){
				repite++;
		  	return ret_ESP = 5;				
			}
			else {
				repite=0;				
			  return ret_ESP = 1;
			}
		}	
		return ret_ESP = 6;	
	
