Ledrunning/animationClock/src/WEB/web_esp8266.c
}

//********************************************************************************************
//
// 6  ****         ПОЛУЧЕНИЕ IP & MAC АДРЕСА
//
//********************************************************************************************
uint8_t is;
unsigned char read_MAC_AT(void)
{	  
	  static uint8_t repite;
	
		error_check (2000); 
		arr_data_clear();
		array_clear();	
	
	  send_Uart_str(USART2,"AT+CIFSR\r\n");
	  do{			
			
			read_str_uart(Buff_Uart);
		}
		while((!strstr(Buff_Uart,"STAMAC")) && (!strstr(Buff_Uart,"ERROR"))&& (!strstr(Buff_Uart,"busy")) && (TIM4->CR1 & TIM_CR1_CEN));
		TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	  
		
//		if (strstr(Buff_Uart,"STAIP"))
//		{
//			arr_data_clear();
//			strncpy (arr_data, (Buff_Uart+15), ((strlen(Buff_Uart))-16));
//			sprintf (Buff_Uart, "IP: %s", arr_data);
//			//WriteString( 3, 0, Buff_Uart, GREEN);	
//			//delay_ms (200);
//      error_check (2000); 
//	    send_Uart_str(USART2,"AT+CIFSR\r\n");
//	    do{
//		  	read_str_uart(Buff_Uart);
//		    }
//		  while((!strstr(Buff_Uart,"MAC")) && (!strstr(Buff_Uart,"ERROR"))&& (!strstr(Buff_Uart,"busy")) && (TIM4->CR1 & TIM_CR1_CEN));
//		  TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	 			
//		}
		if (strstr(Buff_Uart,"STAMAC"))
		{
			uint8_t mac_c=0;
			arr_data_clear();
			array_clear();
			strcpy (arr_data,"#");
			for (is=16; is < 32; is=is+3) {
			  strncat(arr_data, (Buff_Uart+is), 2);
				if (mac_c<5){
					mac_c++;
			    strncat(arr_data, ":", 1);
				}
			}	
			sprintf (mac, "%s", arr_data+1);
			//WriteString( 4, 0, array, GREEN);	
			//LogOut_wifi(x_print,   y_print, array, &font_log, GREEN, BLACK);		
			LogOut_wifi(x_print,   y_print, "MAC OK", &font_log, GREEN, BLACK);		
			//delay_ms (200);
			return ret_ESP = 7;	
		}		
		else if (strstr(Buff_Uart,"ERROR"))
		{
			//WriteString( 2, 0, "Ошибка", RED);
      LogOut_wifi(x_print,   y_print, "MAC ERROR", &font_log, GREEN, BLACK);					
			//delay_ms (200);
			return ret_ESP = 1;						
		}
		else if ((Buff_Uart)||(!Buff_Uart))
		{
			//WriteString( 2, 0, "time out, return" , WHITE);
			LogOut_wifi(x_print,   y_print, "Time out, return 6", &font_log, GREEN, BLACK);		
			//delay_ms (500);
		
			
			if (repite<3){
				repite++;
		  	return ret_ESP = 6;				
			}
			else {
				repite=0;				
			  return ret_ESP = 1;
			}
			
			
		}	
}

//********************************************************************************************
//
// 7  ****         ПРОВЕРКА МНОЖЕСТВЕННЫХ ИЛИ ОДИНОЧНЫХ ПОДКЛЮЧЕНИЙ, необходимо одиночные.
//
//********************************************************************************************
unsigned char cipmux_AT(void)
{	
		error_check (10000); 
	  arr_data_clear();
		array_clear();	
	
	  send_Uart_str(USART2,"AT+CIPMUX?\r\n");
	  do{
			read_str_uart(Buff_Uart);
		}
		while((!strstr(Buff_Uart,"MUX:1")) && (!strstr(Buff_Uart,"MUX:0"))&& (!strstr(Buff_Uart,"ERROR")) && (TIM4->CR1 & TIM_CR1_CEN));
		TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	  
		
		if (strstr(Buff_Uart,"MUX:0"))
		{
			//WriteString( 5, 0, "MUX:0, OK" , GREEN);
			LogOut_wifi(x_print,   y_print, "MUX 0, OK" , &font_log, GREEN, BLACK);		
			//delay_ms (200);
			return ret_ESP = 8;						
		}
		else if (strstr(Buff_Uart,"MUX:1"))
		{
			//WriteString( 5, 0, "multi, изменение", RED);
			LogOut_wifi(x_print,   y_print, "multi", &font_log, GREEN, BLACK);		
			//******** контрольное закрытие соединения
			error_check (10000); 
  	  send_Uart_str(USART2,"AT+CIPCLOSE\r\n");
  	  do{
	  		read_str_uart(Buff_Uart);
	    	}
  		while((!strstr(Buff_Uart,"MUX=1")) && (!strstr(Buff_Uart,"CLOSED"))&& (!strstr(Buff_Uart,"ERROR")) && (TIM4->CR1 & TIM_CR1_CEN));
	  	TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера			
			//******** изменение режима на одиночные подключения
			error_check (10000); 
  	  send_Uart_str(USART2,"AT+CIPMUX=0\r\n");
  	  do{
	  		read_str_uart(Buff_Uart);
	    	}
  		while((!strstr(Buff_Uart,"MUX:1")) && (!strstr(Buff_Uart,"OK"))&& (!strstr(Buff_Uart,"ERROR")) && (TIM4->CR1 & TIM_CR1_CEN));
	  	TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера
			
			//delay_ms (200);			
			return ret_ESP = 7;		// возврат в эту-же функцию в начало				
		}
		else if (strstr(Buff_Uart,"ERROR"))
		{
			//WriteString( 5, 0, "Ошибка", RED);	
			LogOut_wifi(x_print,   y_print, "ERROR", &font_log, GREEN, BLACK);		
			//delay_ms (200);
			return ret_ESP = 1;			// сброс			
		}
		else if ((Buff_Uart)||(!Buff_Uart))
		{
			//WriteString( 5, 0, "time out, return" , WHITE);
			LogOut_wifi(x_print,   y_print, "Time out, return 7", &font_log, GREEN, BLACK);		
			//delay_ms (500);
			return ret_ESP = 1; // сброс
		}		
		return ret_ESP = 8;	
}

//********************************************************************************************
//
// 8  ****         ПОЛУЧЕНИЕ ДАННЫХ С ДАТЧИКОВ, ФОРМИРОВАНИЕ СТРОКИ ОТПРАВКИ
//
//********************************************************************************************
extern float bmp280_t;
extern float bmp280_hf;
extern float bmp280_p;
extern int err_AM2320;
extern float am2320_h;
extern err_t err_ds18b20;
extern float ds18b20_t;

unsigned char lead_data_sensor(void)
{
	  uint8_t er=1;
	
		arr_data_clear();
		array_clear();
	
	  strcat (arr_data,"#");	
	  strcat (arr_data, mac);
	  strcat (arr_data,"#GFXclock\n");
	
	  if (err_ds18b20==E_NO_ERROR){
    	sprintf(array, "#T1#%2.2f#Home_Temperature\n", ds18b20_t );
		  strcat (arr_data, array);
			er=0;
	  }
		
//	  if (err_AM2320==0){
//	    sprintf(array,"#H1#%2.2f#Home_Humidity\n", am2320_h ); 
//		  strcat (arr_data, array);
//			er=0;			
//		}
		
		if(!get_BME280_Error()){
	    sprintf(array,"#H1#%2.2f#Home_Humidity\n", (float)bmp280_hf/10 ); 
		  strcat (arr_data, array);	
			er=0;			
		}		
		
		if(!get_BME280_Error()){
	    sprintf(array,"#P1#%2.2f#Home_Pressure\n", bmp280_p ); 
		  strcat (arr_data, array);	
			er=0;			
		}
		
		strcat (arr_data, "##");
	
		len_data = 0;
		len_data = strlen (arr_data);
	
		if (er==1){
			LogOut_wifi(x_print,   y_print, "Sensors not work!", &font_log, GREEN, BLACK);
			return ret_ESP = 13;			
		}
	  else {
			LogOut_wifi(x_print,   y_print, "Sensors OK", &font_log, GREEN, BLACK);			
			return ret_ESP = 9;
		}
}


//********************************************************************************************
//
// 9  ****         ПОДКЛЮЧЕНИЕ К СЕРВЕРУ
//
//********************************************************************************************
unsigned char connect_serv_AT(void)
{ static uint8_t rst;
	static uint8_t repite;
	
		error_check (10000); 
//	  arr_data_clear();
//		array_clear();	
	
