Ledrunning/animationClock/src/WEB/web_esp8266.c
	  send_Uart_str(USART2,"AT+CIPSTART=\"TCP\",\"narodmon.ru\",8283\r\n");

	  do{
			read_str_uart(Buff_Uart);
		}
		while((!strstr(Buff_Uart,"OK"))&& (!strstr(Buff_Uart,"CONNECT")) && (!strstr(Buff_Uart,"CLOSED"))&& (!strstr(Buff_Uart,"ERROR")) && (TIM4->CR1 & TIM_CR1_CEN));
		TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	  
		
		if ((strstr(Buff_Uart,"OK"))||(strstr(Buff_Uart,"CONNECT")))
		{
			//WriteString( 6, 0, "Соединен!            " , GREEN);
			LogOut_wifi(x_print,   y_print, "Narodmon connected", &font_log, GREEN, BLACK);
			rst = 0;
			//delay_ms (200);
			return ret_ESP = 10;						
		}
		else if ((strstr(Buff_Uart,"CLOSED"))||(strstr(Buff_Uart,"ERROR")) )
		{
			sprintf (array, "CLOSED %u repite", rst);
			if (!rst){
				//WriteString( 6, 0, array, RED);	
				LogOut_wifi(x_print,   y_print, array, &font_log, GREEN, BLACK);
				//delay_ms (200);
				}
			else {
				//WriteString( 6, 0, array, YELLOW);
				LogOut_wifi(x_print,   y_print, array, &font_log, GREEN, BLACK);		
				//delay_ms (200);
			}
			//******** контрольное закрытие соединения
			error_check (10000); 
  	  send_Uart_str(USART2,"AT+CIPCLOSE\r\n");
  	  do{
	  		read_str_uart(Buff_Uart);
	    	}
  		while((!strstr(Buff_Uart,"MUX=1")) && (!strstr(Buff_Uart,"CLOSED"))&& (!strstr(Buff_Uart,"ERROR")) && (TIM4->CR1 & TIM_CR1_CEN));
	  	TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	
			//delay_ms (200);
				if(rst++ > 4){
					rst = 0; 
					//WriteString( 7, 0, "Сброс", YELLOW); 
					LogOut_wifi(x_print,   y_print, "Reset", &font_log, GREEN, BLACK);		
					//delay_ms (200); 
				  return ret_ESP = 1; 
				}
				else  {
				  return ret_ESP = 9; 
				}
		}
		else if ((Buff_Uart)||(!Buff_Uart))
		{
			//WriteString( 7, 0, "time out, return" , WHITE);
			LogOut_wifi(x_print,   y_print, "Time out, return 9", &font_log, GREEN, BLACK);		
			//delay_ms (500);
			if (repite<3){
				repite++;
		  	return ret_ESP = 9;				
			}
			else {
				repite=0;				
			  return ret_ESP = 1;
			}
		}		
}
//********************************************************************************************
//
// 10 ****         ОТПРАВКА ДАННЫХ НА СЕРВЕР narodmon.ru
//
//********************************************************************************************
unsigned char send_data_AT (void)
{
	static uint8_t repite;
	
		//WriteString( 7, 0, "Отправка данных!" , GREEN);
		//delay_ms (50);
		error_check (10000); 
//	  arr_data_clear();
//		array_clear();	
	
		sprintf( array,"AT+CIPSEND=%u\r\n", len_data); 

	  send_Uart_str(USART2,array);
	  do{
			read_str_uart(Buff_Uart);
		}
		while((!strstr(Buff_Uart,">")) && (!strstr(Buff_Uart,"ERROR"))&& (!strstr(Buff_Uart,"link is not"))&& (TIM4->CR1 & TIM_CR1_CEN));
		TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	  
		
		if (strstr(Buff_Uart,">"))
		{
			error_check (10000); 
	    send_Uart_str(USART2,arr_data);
			hard_reset = 0;   // т.к. успешно отправлено, сбрасуем флаг "железного" ресета (через вывод МС)
			send_OK = 10; // флаг отправки данных
	    do{
			  read_str_uart(Buff_Uart);
		  }
   		while((!strstr(Buff_Uart,"SEND")) && (!strstr(Buff_Uart,"ERROR"))&& (TIM4->CR1 & TIM_CR1_CEN));
		  TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	
			
			if (strstr(Buff_Uart,"SEND"))
  		{			
	  			//WriteString( 8, 0, "Успешно         ", MAGENTA);
				  //LogOut_wifi(x_print,   y_print, "Send OK, narodmon", &font_log, GREEN, BLACK);		
					buff_clear ();
		  	  return ret_ESP = 11;	
		  }
			else if (strstr(Buff_Uart,"ERROR"))			
			{
					//WriteString( 8, 0, "Ошибка, отмена  ", RED);	
          LogOut_wifi(x_print,   y_print, "Narodmon send error,", &font_log, GREEN, BLACK);						
			    return ret_ESP = 12;		
			}
		}
		else if (strstr(Buff_Uart,"link is not"))
		{
			//WriteString( 8, 0, "Нет подключения", RED);	
			LogOut_wifi(x_print,   y_print, "Not connect", &font_log, GREEN, BLACK);		
			//delay_ms (100);
			return ret_ESP = 9;										
		}
		else if (strstr(Buff_Uart,"ERROR"))
		{
			//WriteString( 8, 0, "Ошибка, возврат", RED);	
			LogOut_wifi(x_print,   y_print, "Error, return", &font_log, GREEN, BLACK);		
			//delay_ms (100);
			return ret_ESP = 1;										
		}
		else if ((Buff_Uart)||(!Buff_Uart))
		{
			//WriteString( 8, 0, "time out, return" , WHITE);
			LogOut_wifi(x_print,   y_print, "Time out, return 10", &font_log, GREEN, BLACK);		
			//delay_ms (500); 
			if (repite<3){
				repite++;
		  	return ret_ESP = 5;				
			}
			else {
				repite=0;				
			  return ret_ESP = 1;
			}
		}		
}

//********************************************************************************************
//
// 11 ****         ПОЛУЧЕНИЕ ОТВЕТА ОТ СЕРВЕРА
//
//********************************************************************************************
unsigned char read_ret_server (void)
{
	  error_check (2000); 
	  arr_data_clear();
		array_clear();	
	
	  do{
			read_str_uart(Buff_Uart);
		}
		while((!strstr(Buff_Uart,"OK")) && (!strstr(Buff_Uart,"CLOSED"))&& (TIM4->CR1 & TIM_CR1_CEN));
		TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	  
		//LCD_Fill(BLACK);
		if ((strstr(Buff_Uart,"OK"))||(strstr(Buff_Uart,"CLOSED")))
		{			  
	  	//WriteString( 0, 0, "Получено        ", MAGENTA);	
			LogOut_wifi(x_print,   y_print, "Narodmon send end", &font_log, GREEN, BLACK);		
	   	//delay_ms (200);
		}
		else if ((Buff_Uart)||(!Buff_Uart))
		{
			//WriteString( 0, 0, "Время вышло" , WHITE);
			LogOut_wifi(x_print,   y_print,  "Time out 11", &font_log, GREEN, BLACK);		
			//delay_ms (500);
		 //	return ret_ESP = 1;
		}	
			//WriteString( 1, 0, (Buff_Uart+1), BLUE);	
		//LogOut_wifi(x_print,   y_print+18, (Buff_Uart+1), &font_log, GREEN, BLACK);		
		//delay_ms (1000);
		return ret_ESP = 12;	
}

//********************************************************************************************
//
// 12 ****         ЗАКРЫТИЕ СОЕДИНЕНИЯ
//
//********************************************************************************************
unsigned char closed_connect  (void)
{
		error_check (1000); 
	  arr_data_clear();
		array_clear();	
	
	  send_Uart_str(USART2,"AT+CIPCLOSE\r\n");
	  do{
			read_str_uart(Buff_Uart);
		}
		while((!strstr(Buff_Uart,"CLOSED")) && (!strstr(Buff_Uart,"ERROR"))&& (!strstr(Buff_Uart,"link is not"))&& (TIM4->CR1 & TIM_CR1_CEN));
		TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	  
		//LCD_Fill(BLACK);
		if (strstr(Buff_Uart,"CLOSED"))
		{
	  	//WriteString( 2, 0, "Закрытие", YELLOW);
       LogOut_wifi(x_print,   y_print, "Narodmon closed", &font_log, GREEN, BLACK);					
	   	//delay_ms (200);
		}
		else if ((strstr(Buff_Uart,"ERROR"))|| (strstr(Buff_Uart,"link is not")))
		{
			//WriteString( 2, 0, "Закрыто, возврат", YELLOW);	
			LogOut_wifi(x_print,   y_print, "Closed, return", &font_log, GREEN, BLACK);		
			//delay_ms (200);						
		}
		else if ((Buff_Uart)||(!Buff_Uart))
		{
			//WriteString( 2, 0, "time out, return" , WHITE);
			LogOut_wifi(x_print,   y_print, "Time out, return 12", &font_log, GREEN, BLACK);		
			//delay_ms (500);
		}	
		return ret_ESP = 13;		
}



