Ledrunning/animationClock/src/WEB/web_esp8266.c
//  uart_send_string("AT+CIPSTART,\"www.yandex.ru\",80\r\n");    // с какого сайта хотим скачать
//  uart_send_string("AT+CIPSEND,\"GET /\r\n\"");    // какую страницу
// "<dif id=\"current_time"

//********************************************************************************************
//
// 13  ****         ПОДКЛЮЧЕНИЕ К СЕРВЕРУ
//
//********************************************************************************************
unsigned char connect_serv_AT_time(void)
{ static uint8_t rst;
  static uint8_t repite;
	
		error_check (10000); 
	  arr_data_clear();
		array_clear();	
	
	  send_Uart_str(USART2,"AT+CIPSTART=\"UDP\",\"europe.pool.ntp.org\",123\r\n"); //130.102.128.23 

	  do{
			read_str_uart(Buff_Uart);
		}
		while((!strstr(Buff_Uart,"OK"))&& (!strstr(Buff_Uart,"CONNECT")) && (!strstr(Buff_Uart,"CLOSED"))&& (!strstr(Buff_Uart,"ERROR")) && (TIM4->CR1 & TIM_CR1_CEN));
		TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	  
		
		if ((strstr(Buff_Uart,"OK"))||(strstr(Buff_Uart,"CONNECT")))
		{
			//WriteString( 6, 0, "Соединен!            " , GREEN);
			LogOut_wifi(x_print,   y_print, "Connect server time", &font_log, GREEN, BLACK);		
			rst = 0;
			//delay_ms (200);
			return ret_ESP = 14;						
		}
		else
		if ((strstr(Buff_Uart,"CLOSED"))||(strstr(Buff_Uart,"ERROR")) )
		{
			sprintf (array, "CLOSED %u repite", rst);
			if (!rst){
				//WriteString( 6, 0, array, RED);	
				LogOut_wifi(x_print,   y_print, array, &font_log, GREEN, BLACK);		
				//delay_ms (200);
				}
			else {
				//WriteString( 6, 0, array, YELLOW);
				LogOut_wifi(x_print,   y_print, array, &font_log, GREEN, BLACK);		
				//delay_ms (200);
			}
			//******** контрольное закрытие соединения
			error_check (10000); 
  	  send_Uart_str(USART2,"AT+CIPCLOSE\r\n");
  	  do{
	  		read_str_uart(Buff_Uart);
	    	}
  		while((!strstr(Buff_Uart,"MUX=1")) && (!strstr(Buff_Uart,"CLOSED"))&& (!strstr(Buff_Uart,"ERROR")) && (TIM4->CR1 & TIM_CR1_CEN));
	  	TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	
			//delay_ms (200);
				if(rst++ > 4){
					rst = 0; 
					//WriteString( 7, 0, "Сброс", YELLOW); 
					LogOut_wifi(x_print,   y_print, "Error", &font_log, GREEN, BLACK);		
					//delay_ms (200); 
			if (repite<3){
				repite++;
		  	return ret_ESP = 12;				
			}
			else {
				repite=0;				
			  return ret_ESP = 1;
			}
				}
				else  {
				  return ret_ESP = 13; 
				}
		}
		else //if ((Buff_Uart)||(!Buff_Uart))
		{
			//WriteString( 7, 0, "time out, return" , WHITE);
			LogOut_wifi(x_print,   y_print, "Time out, return 13", &font_log, GREEN, BLACK);	
			send_Uart_str(USART2,"AT+CIPCLOSE\r\n");
			//delay_ms (500);
			return ret_ESP = 13;
		}		
}
//********************************************************************************************
//
// 14 ****         ОТПРАВКА ДАННЫХ НА СЕРВЕР
//
//********************************************************************************************
const int NTP_PACKET_SIZE= 48; // NTP time stamp is in the first 48 bytes of the message	
uint8_t packetBuffer[ NTP_PACKET_SIZE]; //buffer to hold incoming and outgoing packets

unsigned char send_data_AT_time (void)
{
static uint8_t repite;    
	  
		for(uint8_t i =0; i<NTP_PACKET_SIZE;i++){
			  packetBuffer[i]=0;
		}
    // Initialize values needed to form NTP request
    // (see URL above for details on the packets)
    packetBuffer[0] = 0xE3;   // LI, Version, Mode
    packetBuffer[1] = 0;     // Stratum, or type of clock
    packetBuffer[2] = 6;     // Polling Interval
    packetBuffer[3] = 0xEC;  // Peer Clock Precision
	  // 8 bytes of zero for Root Delay & Root Dispersion
    packetBuffer[12]  = 49;
    packetBuffer[13]  = 0x4E;
    packetBuffer[14]  = 49;
    packetBuffer[15]  = 52;
	
		array_clear ();
		sprintf( array,"AT+CIPSEND=%u\r\n", NTP_PACKET_SIZE); 
		error_check (20000); 
	  send_Uart_str(USART2,array);
	
	  do{
			read_str_uart(Buff_Uart);
		}
		while((!strstr(Buff_Uart,">")) && (!strstr(Buff_Uart,"ERROR"))&& (!strstr(Buff_Uart,"link is not"))&& (TIM4->CR1 & TIM_CR1_CEN));
		TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	  
		
		if (strstr(Buff_Uart,">"))
		{
			error_check (20000); 
			for(uint8_t i =0; i<NTP_PACKET_SIZE;i++){
			  send_Uart(USART2,packetBuffer[i]);
			}
	    //send_Uart_str(USART2,packetBuffer);
			hard_reset = 0;   // т.к. успешно отправлено, сбрасуем флаг "железного" ресета (через вывод МС)
			send_OK = 10; // флаг отправки данных
	    do{
			  read_str_uart(Buff_Uart);
		  }
   		while((!strstr(Buff_Uart,"SEND")) && (!strstr(Buff_Uart,"ERROR"))&& (TIM4->CR1 & TIM_CR1_CEN));
		  TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	
			
			if (strstr(Buff_Uart,"SEND"))
  		{			
	  			//WriteString( 8, 0, "Успешно         ", MAGENTA);
				  //LogOut_wifi(x_print,   y_print, "Send to time server OK", &font_log, GREEN, BLACK);		
					//buff_clear ();
		  	  return ret_ESP = 15;	
		  }
			else if (strstr(Buff_Uart,"ERROR"))			
			{
					//WriteString( 8, 0, "Ошибка, отмена  ", RED);	
		    	LogOut_wifi(x_print,   y_print, "Error, cancel", &font_log, GREEN, BLACK);				
			    return ret_ESP = 14;		
			}
		}
		else if (strstr(Buff_Uart,"link is not"))
		{
			//WriteString( 8, 0, "Нет подключения", RED);	
			LogOut_wifi(x_print,   y_print, "Not connect", &font_log, GREEN, BLACK);
			//delay_ms (100);
			return ret_ESP = 13;										
		}
		else if (strstr(Buff_Uart,"ERROR"))
		{
			//WriteString( 8, 0, "Ошибка, возврат", RED);	
			LogOut_wifi(x_print,   y_print, "Error, return", &font_log, GREEN, BLACK);
			//delay_ms (100);
			return ret_ESP = 13;										
		}
		else if ((Buff_Uart)||(!Buff_Uart))
		{
			//WriteString( 8, 0, "time out, return" , WHITE);
			LogOut_wifi(x_print,   y_print, "Time out, return 14", &font_log, GREEN, BLACK);
			//delay_ms (500); 
			if (repite<5){
				repite++;
		  	return ret_ESP = 13;				
			}
			else {
				repite=0;				
			  return ret_ESP = 1;
			}
		}		
}

//********************************************************************************************
//
// 15 ****         ПОЛУЧЕНИЕ ОТВЕТА ОТ СЕРВЕРА
//
//********************************************************************************************
RTC_DateTimeTypeDef RTC_DateTime_ntp;
extern RTC_DateTimeTypeDef RTC_DateTime, RTC_DateTime_old;
extern uint32_t RTC_Counter ;

