Ledrunning/animationClock/src/WEB/web_esp8266.c
#define MAKE_RGB565(r, g, b) TFT9341_MAKE_RGB565(r, g, b)
#define CLOCK_TIME_COLOR MAKE_RGB565(0x00, 0xff, 0x00)


unsigned char read_ret_server_time (void)
{
static uint8_t repite;   
	
	  int acksize = NTP_PACKET_SIZE + 1 + 2 + 8; // ESP8266 adds a space, a CRLF and starts with "+IPD,48:"
	
	  error_check (20000); 
	  arr_data_clear();
		array_clear();	
		
	  do{
			read_str_uart(Buff_Uart);
		}
		while((!strstr(Buff_Uart,"+IPD,48")) && (TIM4->CR1 & TIM_CR1_CEN));
		TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	  
		
		if (strstr(Buff_Uart,"+IPD,48"))
		{			
      for(uint8_t i=0; i<48; i++){
				packetBuffer[i]=Buff_Uart[i+9];
			}
		 unsigned long highWord = (packetBuffer[40]<<8) + packetBuffer[41];
     unsigned long lowWord = (packetBuffer[42]<<8) + packetBuffer[43];  
     // combine the four bytes (two words) into a long integer
     // this is NTP time (seconds since Jan 1 1900):
     unsigned long secsSince1900 = highWord << 16 | lowWord;
		  // Unix time starts on Jan 1 1970. In seconds, that's 2208988800:
     const unsigned long seventyYears  = 2208988800UL;
     // subtract seventy years:
     unsigned long epoch = secsSince1900 - seventyYears; 
     unsigned long DST = 60*60*3; // adjust to your GMT+DST 
     unsigned long timestamp = epoch + DST;		
		 RTC_GetDateTime(timestamp, &RTC_DateTime_ntp);
		 RTC_Counter = RTC_GetCounter();
	   RTC_GetDateTime(RTC_Counter, &RTC_DateTime);
		 RTC_DateTime_old=RTC_DateTime;
			
		 LogOut_wifi(x_print,   y_print, "Get time OK", &font_log, GREEN, BLACK);
			
		 if ((RTC_DateTime_ntp.RTC_Year>=2019)
			 &&(RTC_DateTime_ntp.RTC_Month<13)
			 &&(RTC_DateTime_ntp.RTC_Date<32)
		   &&(RTC_DateTime_ntp.RTC_Minutes<60)
		   &&(RTC_DateTime_ntp.RTC_Minutes>0)
//		 	 &&(RTC_DateTime.RTC_Year==RTC_DateTime_ntp.RTC_Year)
			 &&(RTC_DateTime.RTC_Month== RTC_DateTime_ntp.RTC_Month)
			 &&(RTC_DateTime.RTC_Date== RTC_DateTime_ntp.RTC_Date)	
		 ){

       clock_gui_set_time_color(MAKE_RGB565(0xff, 0xff, 0xff));						

			 
			 if ((RTC_DateTime.RTC_Year!=RTC_DateTime_ntp.RTC_Year) ||    
			  (RTC_DateTime.RTC_Month!= RTC_DateTime_ntp.RTC_Month) ||  
			  (RTC_DateTime.RTC_Date!= RTC_DateTime_ntp.RTC_Date))		{
					clock_gui_set_monthday(RTC_DateTime.RTC_Date);
					clock_gui_set_month(RTC_DateTime.RTC_Month-1);
					clock_gui_set_weekday(RTC_DateTime.RTC_Wday);
				}
			 
			 if ((RTC_DateTime.RTC_Hours!=RTC_DateTime_ntp.RTC_Hours)||		  
			  (RTC_DateTime.RTC_Minutes!=RTC_DateTime_ntp.RTC_Minutes)) clock_gui_set_time(RTC_DateTime.RTC_Hours, RTC_DateTime.RTC_Minutes);   
		
			 
			 
			 RTC_DateTime.RTC_Year=RTC_DateTime_ntp.RTC_Year;
			 RTC_DateTime.RTC_Month= RTC_DateTime_ntp.RTC_Month;
			 RTC_DateTime.RTC_Date= RTC_DateTime_ntp.RTC_Date;		
			 
			 RTC_DateTime.RTC_Hours=RTC_DateTime_ntp.RTC_Hours;			 
			 RTC_DateTime.RTC_Minutes=RTC_DateTime_ntp.RTC_Minutes;
			 RTC_DateTime.RTC_Seconds=RTC_DateTime_ntp.RTC_Seconds;
			 
		   RTC_SetCounter(timestamp);//RTC_GetRTC_Counter(&RTC_DateTime) 

			 delay_ms(500);
			 
        clock_gui_set_time_color(CLOCK_TIME_COLOR);			 
		 }
			
		}		
		else if ((Buff_Uart)||(!Buff_Uart))
		{
			LogOut_wifi(x_print,   y_print, "Get time error", &font_log, GREEN, BLACK);
			
			if (repite<3){
				repite++;
		  	return ret_ESP = 14;				
			}
			else {
				repite=0;				
			  return ret_ESP = 16;
			}
		}	
		return ret_ESP = 16;	
}

//********************************************************************************************
//
// 16 ****         ЗАКРЫТИЕ СОЕДИНЕНИЯ
//
//********************************************************************************************
unsigned char closed_connect_time  (void)
{
		error_check (1000); 
	  arr_data_clear();
		array_clear();	
	
	  send_Uart_str(USART2,"AT+CIPCLOSE\r\n");
	  do{
			read_str_uart(Buff_Uart);
		}
		while((!strstr(Buff_Uart,"CLOSED")) && (!strstr(Buff_Uart,"ERROR"))&& (!strstr(Buff_Uart,"link is not"))&& (TIM4->CR1 & TIM_CR1_CEN));
		TIM4->EGR |= TIM_EGR_UG;  TIM4->CR1 &= ~TIM_CR1_CEN;     // stop таймера	  
		//LCD_Fill(BLACK);
		if (strstr(Buff_Uart,"CLOSED"))
		{
	  	//WriteString( 2, 0, "Закрытие", YELLOW);	
			LogOut_wifi(x_print,   y_print, "Server time closed", &font_log, GREEN, BLACK);
	   	//delay_ms (200);
		}
		else if ((strstr(Buff_Uart,"ERROR"))|| (strstr(Buff_Uart,"link is not")))
		{
			//WriteString( 2, 0, "Закрыто, возврат", YELLOW);	
			LogOut_wifi(x_print,   y_print, "Closed, return", &font_log, GREEN, BLACK);
			//delay_ms (200);						
		}
		else if ((Buff_Uart)||(!Buff_Uart))
		{
			//WriteString( 2, 0, "time out, return" , WHITE);
			LogOut_wifi(x_print,   y_print, "Time out, return 16", &font_log, GREEN, BLACK);
			//delay_ms (500);
		}	
		return ret_ESP = 17;		
}



void arr_data_clear(void)															//	очищаем буфер
{
	uint16_t i;
	
	for(i=0;i<256;i++)
	{
		arr_data[i]=0;
	}
}
void array_clear(void)															//	очищаем буфер
{
	uint16_t i;
	
	for(i=0;i<256;i++)
	{
		array[i]=0;
	}

}

